andersonmeurer/relle.pinel-eletrico-cc/srcWorkTemp/rh/firmware/firmware/uc_libc_dev/_arch/arm_lpc/arch_kit_lpc1788_pr111.h
#ifndef __ARCH_ARCH_KITLPC1788PR111_H
#define __ARCH_ARCH_KITLPC1788PR111_H


// ESTA ARQUITETURA UTILIZA O PROCESSADOR LPC1788

#include "lpc1788.h"

// ###################################################################################################################
// AJUSTE DE CLOCKS
// Das três opções de fonte de clock (OSC interno, RTC e OSC externo).
// 	Vamos trabalhar somente com o ocilador externo conectado ao PLL
//	As bibliotecas não estão prepardos para outros tipos de fontes de clock
	
// Passo 1: Escolher a frequencia do cristal (entre 1MHz a 25MHz).
// 		Se utilizar USB escolher valores de 12, 16 ou 24MHz para podemor gerar um clock exato de 48MHz para a USB
#define F_CPU 		12000000
// Passo 2: Determinar a frequência desejada para a CPU (entre 10MHz a 120MHz).
//		Levar em consideração da velocidade das memórias
// 		Deve ser divisor inteiro de F_CPU
#define CCLK 		120000000
// Passo 3: Determinar a frequência desejada para os periféricos (entre 10MHz a 120MHz).
// 		Deve ser divisor inteiro de F_CPU
// 		Quanto menor o clock menor será o consumo e aquecimento
#define PCLK		60000000

// VAMOS CALCULAR MANUALMENTE OS VALORES DOS DIVISORES PARA OBTER AS FREQUENCIAS ACIMA
// Passo 4: Calcular o valor da saída do PLL0 (PLL_OUT) de acordo com CCLKDIV. Utilize a fórmula:
//		CCLKDIV: Valores entre 1 a 31. Divisor do PLL(FCCO) para o CCLK. Começar pelo valor baixo.
//		PLL_OUT = CCLK * CCLKDIV
//			PLL_OUT deve ficar entre entre 9.75MHz a 160MHz.
//				Se não ficar nesse limite encontre outro CCLKDIV ou CCLK
#define PLL_OUT 120000000
#define CCLKDIV 1
// Passo 5: Definir o PLL_M. Calcule pela formula:
//		PLL_M = PLL_OUT/F_CPU
//			PLL_M deve ficar entre 1 a 31
//				Se não ficar dentro desse limite, volte ao passo 5 e encontre outro PLL_OUT ou F_CPU
#define PLL_M	10
// Passo 6: Definir o PLL_P através do FCCO. Calcule pela formula:
//		PLL_P deve ser 1, 2, 4 ou 6. Começe pelo valor baixo
//		FCCO = PLL_OUT * 2 * PLL_P
//			FCCO deve ficar entre 156MHz a 320MHz.
//				Se não ficar dentro desse limite, mude PLL_P ou volte ao passo 5 e encontre outro PLL_OUT ou F_CPU
#define PLL_P 	1
// Passo 7: Definir valor para PCLKDIV, que é a divisão do clock do PLL(FCCO) para o PCLK. Utilize a fórmula:
//		PCLKDIV = (PLL_OUT/PCLK)
//		PCLKDIV deve ficar entre 1 a 31
//			Se o valor for fracionário arredonde o valor para cima e recalcule PCLK pelas fórmulas:
//				PCLKDIV = PCLKSEL_PCLKDIV_arrendondado
//				PLCK = (PLLOUT / PCLKDIV)
#define PCLKDIV 2

// VAMOS CALCULAR MANUALMENTE OS VALORES DOS DIVISORES PARA OBTER A FREQUENCIA DO PLL1 para o USB
// Passo 8: Calcular o valor da saída do PLL1 (PLL1_OUT) de acordo com USBCLKDIV. Utilize a fórmula:
//		USBCLKDIV: Valores entre 1 a 31. Divisor do PLL1 (FCCO) para o USBCLK. Começar pelo valor baixo.
//		PLL1_OUT = USBCLK * USBCLKDIV
//		USBCLK é sempre 48Mhz, logo:
//		PLL1_OUT = 48 * USBCLKDIV
//			PLL1_OUT deve ficar entre entre 9.75MHz a 160MHz.
//				Se não ficar nesse limite encontre outro USBCLKDIV
#define PLL1_OUT 96000000
#define USBCLKDIV 2
// Passo 9: Definir o PLL1_M. Calcule pela formula:
//		PLL1_M = PLL1_OUT/F_CPU
//			PLL1_M deve ficar entre 1 a 31
//				Se não ficar dentro desse limite, volte ao passo 8 e encontre outro PLL1_OUT ou F_CPU
#define PLL1_M	8
// Passo 10: Definir o PLL1_P através do FCCO. Calcule pela formula:
//		PLL_P deve ser 1, 2, 4 ou 6. Começe pelo valor baixo
//		FCCO = PLL_OUT * 2 * PLL_P
//			FCCO deve ficar entre 156MHz a 320MHz.
//				Se não ficar dentro desse limite, mude PLL_P ou volte ao passo 5 e encontre outro PLL_OUT ou F_CPU
#define PLL1_P 	1


// PLL0
#define PLLCFG_MSEL   ((PLL_M-1) << 0) 	// Multiplicador M do PLL
#if (PLL_P == 1)
#define PLLCFG_PSEL   0		// Divisor P da saída do PLL
#elif (PLL_P == 2)
#define PLLCFG_PSEL   (1ul<<5)		// Divisor P da saída do PLL
#elif (PLL_P == 4)
#define PLLCFG_PSEL   (2ul<<5)		// Divisor P da saída do PLL
#elif (PLL_P == 8)
#define PLLCFG_PSEL   (3ul<<5)		// Divisor P da saída do PLL
#endif

// PLL1
#define PLL1CFG_MSEL   ((PLL1_M-1) << 0) 	// Multiplicador M do PLL
#if (PLL1_P == 1)
#define PLL1CFG_PSEL   0		// Divisor P da saída do PLL
#elif (PLL1_P == 2)
#define PLL1CFG_PSEL   (1ul<<5)		// Divisor P da saída do PLL
#elif (PLL1_P == 4)
#define PLL1CFG_PSEL   (2ul<<5)		// Divisor P da saída do PLL
#elif (PLL1_P == 8)
#define PLL1CFG_PSEL   (3ul<<5)		// Divisor P da saída do PLL
#endif

// ###################################################################################################################
// DEFINIÇÕES DE MACROS PARA ACESSO A PORTAS GPIO
//				GPIO0		GPIO1		GPIO2		GPIO3		GPIO04
// LPC1788		FAST		FAST		FAST		FAST		FAST

#ifdef FIO0PIN
#define GPIO0_PIN FIO0PIN
#define GPIO0_SET FIO0SET
#define GPIO0_DIR FIO0DIR
#define GPIO0_CLR FIO0CLR
#define GPIO0_MASK FIO0MASK
#define GPIO0 GPIO0_DIR
#endif

#ifdef FIO1PIN
#define GPIO1_PIN FIO1PIN
#define GPIO1_PIN0 FIO1PIN0
#define GPIO1_PIN1 FIO1PIN1
#define GPIO1_PIN2 FIO1PIN2
#define GPIO1_PIN3 FIO1PIN3
#define GPIO1_PIN4 FIO1PIN4
#define GPIO1_PIN5 FIO1PIN5
#define GPIO1_SET FIO1SET
#define GPIO1_SET0 FIO1SET0
#define GPIO1_SET1 FIO1SET1
#define GPIO1_SET2 FIO1SET2
#define GPIO1_SET3 FIO1SET3
#define GPIO1_SET4 FIO1SET4
#define GPIO1_SET5 FIO1SET5
#define GPIO1_DIR FIO1DIR
#define GPIO1_DIR0 FIO1DIR0
#define GPIO1_DIR1 FIO1DIR1
#define GPIO1_DIR2 FIO1DIR2
#define GPIO1_DIR3 FIO1DIR3
#define GPIO1_DIR4 FIO1DIR4
#define GPIO1_DIR5 FIO1DIR5
#define GPIO1_CLR FIO1CLR
#define GPIO1_CLR0 FIO1CLR0
#define GPIO1_CLR1 FIO1CLR1
#define GPIO1_CLR2 FIO1CLR2
#define GPIO1_CLR3 FIO1CLR3
#define GPIO1_CLR4 FIO1CLR4
#define GPIO1_CLR5 FIO1CLR5
#define GPIO1_MASK FIO1MASK
#define GPIO1 GPIO1_DIR
#endif

#ifdef FIO2PIN
#define GPIO2_PIN FIO2PIN
#define GPIO2_SET FIO2SET
#define GPIO2_DIR FIO2DIR
#define GPIO2_CLR FIO2CLR
#define GPIO2_MASK FIO2MASK
#define GPIO2 GPIO2_DIR
#endif

#ifdef FIO3PIN
#define GPIO3_PIN FIO3PIN
#define GPIO3_PIN0 FIO3PIN0
#define GPIO3_PIN1 FIO3PIN1
#define GPIO3_PIN2 FIO3PIN2
#define GPIO3_PIN3 FIO3PIN3
#define GPIO3_SET FIO3SET
#define GPIO3_SET0 FIO3SET0
#define GPIO3_SET1 FIO3SET1
#define GPIO3_SET2 FIO3SET2
#define GPIO3_SET3 FIO3SET3
#define GPIO3_DIR FIO3DIR
#define GPIO3_DIR0 FIO3DIR0
#define GPIO3_DIR1 FIO3DIR1
#define GPIO3_DIR2 FIO3DIR2
#define GPIO3_DIR3 FIO3DIR3
#define GPIO3_CLR FIO3CLR
#define GPIO3_CLR0 FIO3CLR0
#define GPIO3_CLR1 FIO3CLR1
#define GPIO3_CLR2 FIO3CLR2
#define GPIO3_CLR3 FIO3CLR3
#define GPIO3_MASK FIO3MASK
#define GPIO3 GPIO3_DIR
#endif

#ifdef FIO4PIN
#define GPIO4_PIN FIO4PIN
#define GPIO4_SET FIO4SET
#define GPIO4_DIR FIO4DIR
#define GPIO4_CLR FIO4CLR
#define GPIO4_MASK FIO4MASK
#define GPIO3 GPIO3_DIR
#endif

#ifdef FIO5PIN
#define GPIO5_PIN FIO5PIN
#define GPIO5_SET FIO5SET
#define GPIO5_DIR FIO5DIR
#define GPIO5_CLR FIO5CLR
#define GPIO5_MASK FIO5MASK
#define GPIO5 GPIO5_DIR
#endif

////declaração do pino
//#define defPIN(port, mask)	(port * 256 + mask)
//#define outPIN(pin)			*(reg32*)(FIO_BASE_ADDR + (pin/256)*0x20) |= (1UL<<(pin&255))
//#define setPIN(pin)			*(reg32*)(FIO_BASE_ADDR + 0x18 + (pin/256)*0x20)  = (1UL<<(pin&255))
//#define clrPIN(pin)			*(reg32*)(FIO_BASE_ADDR + 0x1c + (pin/256)*0x20)  = (1UL<<(pin&255))
//#define getPIN(pin)		  ((*(reg32*)(FIO_BASE_ADDR + 0x14 + (pin/256)*0x20)  & (1UL<<(pin&255)))>0)


