andersonmeurer/relle.pinel-eletrico-cc/srcWorkTemp/rh/firmware/firmware/uc_libc_dev/_arch/arm_lpc/arch_kit_lpc1788_pr111.h
//// ###################################################################################################################
//// PINOS DE INTERRUPÇÕES EXTERNAS
//
//// EINT0 P2_10
//#define EINT0_PINSEL	 	PINSEL4			// Porta de seleção dos pinos do LPC
//#define EINT0_PINMASK      	(0x00300000)	// Mascara para acessar os pinos para EINT no PINSEL
//#define EINT0_PINS       	(0x00100000)	// Bits de selecção do registrador PINSEL para configurar modo EINT
//
//// EINT1 P2_11
//#define EINT1_PINSEL	 	PINSEL4			// Porta de seleção dos pinos do LPC
//#define EINT1_PINMASK      	(0x00C00000)	// Mascara para acessar os pinos para EINT no PINSEL
//#define EINT1_PINS       	(0x00400000)	// Bits de selecção do registrador PINSEL para configurar modo EINT
//
//// EINT2 P2_12
//#define EINT2_PINSEL	 	PINSEL4			// Porta de seleção dos pinos do LPC
//#define EINT2_PINMASK      	(0x03000000)	// Mascara para acessar os pinos para EINT no PINSEL
//#define EINT2_PINS       	(0x01000000)	// Bits de selecção do registrador PINSEL para configurar modo EINT
//
//// EINT3 P2_13
//#define EINT3_PINSEL	 	PINSEL4			// Porta de seleção dos pinos do LPC
//#define EINT3_PINMASK      	(0x0C000000)	// Mascara para acessar os pinos para EINT no PINSEL
//#define EINT3_PINS       	(0x04000000)	// Bits de selecção do registrador PINSEL para configurar modo EINT
//
// ###################################################################################################################
// UARTs
// BAUNDRATES COM TAXA 0% DE ERRO PARA O 73728000
//  Valores padrões até 115200, 921600, 1152000, 1536000, e 2304000
// IOCON Consultar datasheet página 113
#define UART_BAUDRATE_MAX 1536000


// UART0
// ------------------------------------------------------------------------------
// UART0 - P0_2 como TXD0 e P0_3 como RXD0 em pullup
#define uart0_ConfigPort() 				{ IOCON_P0_02 = 1; IOCON_P0_03 = 0x11;}
// UART0 HANDSHAKING MANUAL - P0_8 como CTS0 e P0_7 como RTS0
//#define uart0_ConfigHandshakingPort() 	{ IOCON_P0_08 = 0x0; IOCON_P0_07 = 0x0;}
	// PINO DE ENTRADA DE CONTROLE DE FLUXO
	#define U0_CTS_DIR		GPIO0_DIR
	#define U0_CTS_PIN		GPIO0_PIN
	#define U0_CTS			BIT_7
	
	// PINO DE SAÍDA DE CONTROLE DE FLUXO
	#define U0_RTS_DIR		GPIO0_DIR
	#define U0_RTS_SET		GPIO0_SET
	#define U0_RTS_CLR		GPIO0_CLR
	#define U0_RTS			BIT_8
	


// UART1
// ------------------------------------------------------------------------------
// UART1 - P0_15 como TXD1 e P0_16 como RXD1 em pullup
#define uart1_ConfigPort() 				{ IOCON_P0_15 = 1; IOCON_P0_16 = 0x11;}
// UART1 HANDSHAKING MANUAL - P0_17 como CTS1 e P0_6 como RTS1
//#define uart1_ConfigHandshakingPort() 	{ IOCON_P0_17 = 0; IOCON_P0_06 = 0x0;}
	// PINO DE ENTRADA DE CONTROLE DE FLUXO
	#define U1_CTS_DIR		GPIO0_DIR
	#define U1_CTS_PIN		GPIO0_PIN
	#define U1_CTS			BIT_6
	
	// PINO DE SAÍDA DE CONTROLE DE FLUXO
	#define U1_RTS_DIR		GPIO1_DIR
	#define U1_RTS_SET		GPIO1_SET
	#define U1_RTS_CLR		GPIO1_CLR
	#define U1_RTS			BIT_17
	

// UART2
// ------------------------------------------------------------------------------
// UART2 - P0_10 como TXD2 e P0_11 como RXD2 em pullup
#define uart2_ConfigPort() 				{ IOCON_P0_10 = 1; IOCON_P0_11 = 0x11;}
// UART2 HANDSHAKING MANUAL- sem suporte
//#define uart2_ConfigHandshakingPort() 	{ #error SEM SUPORTE PARA HANDSHAKING para UART2}

// UART3
// ------------------------------------------------------------------------------
// UART3 - P0_0 como TXD3 e P0_1 como RXD3 em pullup
#define uart3_ConfigPort() 				{ IOCON_P0_00 = 2; IOCON_P0_01 = 0x12;}
// UART3 HANDSHAKING MANUAL - P1_30 como CTS3 e P0_4 como RTS3
//#define uart3_ConfigHandshakingPort() 	{ IOCON_P1_30 = 0; IOCON_P0_04 = 0;}
	// PINO DE ENTRADA DE CONTROLE DE FLUXO
	#define U3_CTS_DIR		GPIO0_DIR
	#define U3_CTS_PIN		GPIO0_PIN
	#define U3_CTS			BIT_3
	
	// PINO DE SAÍDA DE CONTROLE DE FLUXO
	#define U3_RTS_DIR		GPIO1_DIR
	#define U3_RTS_SET		GPIO1_SET
	#define U3_RTS_CLR		GPIO1_CLR
	#define U3_RTS			BIT_4
	


//// ###################################################################################################################
//// I2C
//
//// SCL=P0_28 e SDA=P0_27
//#define I2C0_PINSEL		PINSEL1			// Porta de seleção dos pinos do LPC
//#define I2C0_PINMASK    (0x03C00000)		// Mascara para acessar os pinos para I2C0 no PINSEL
//#define I2C0_PINS     	(0x01400000)	// Bits de selecção do registrador PINSEL para configurar modo I2C
//
//

// ###################################################################################################################
// SPI CHIP SELECTS
#define MMCSD_CS_DIR  		GPIO4_DIR
#define MMCSD_CS_CLR		GPIO4_CLR
#define MMCSD_CS_SET		GPIO4_SET
#define MMCSD_CS  			(1<<26)

#define ENC28J60_CS_DIR  	GPIO4_DIR
#define ENC28J60_CS_CLR		GPIO4_CLR
#define ENC28J60_CS_SET		GPIO4_SET
#define ENC28J60_CS			(1<<21)


// ###################################################################################################################
// SPP0: CLK = P2_22  	MISO = P2_26 	MOSI = P2_27
#define SSP0_PINSEL			PINSEL_P2	// Porta de seleção dos pinos do LPC
#define SSP0_CLK_NUMPIN		22			// Número do Pino do CLK
#define SSP0_MISO_NUMPIN	26			// Número do Pino do MISO
#define SSP0_MOSI_NUMPIN	27			// Número do Pino do MOSI
#define SSP0_NUNFUNC 		2			// Número da função dos pinos para SSP0

// ###################################################################################################################
// SPP1: CLK = P4_20 	MISO = P4_22 	MOSI = P4_23
#define SSP1_PINSEL			PINSEL_P4	// Porta de seleção dos pinos do LPC
#define SSP1_CLK_NUMPIN		20			// Número do Pino do CLK
#define SSP1_MISO_NUMPIN	22			// Número do Pino do MISO
#define SSP1_MOSI_NUMPIN	23			// Número do Pino do MOSI
#define SSP1_NUNFUNC 		3			// Número da função dos pinos para SSP1


// valores temporários
#define TSC2046_CS_DIR  		GPIO2_DIR
#define TSC2046_CS_CLR			GPIO2_CLR
#define TSC2046_CS_SET			GPIO2_SET
#define TSC2046_CS  			BIT_23


// ###################################################################################################################
// TIMERS
// NÃO USAR ESSES TIMERS COM SISTEMA OPERACIOANAIS
#define SYSTIME_USE_TIMER 		0 	// Especifica qual timer o clock do systime vai usar.
									// 	0 se usar o timer0 ou 1 se usar usar o timer1
#define UIP_CLOCK_USE_TIMER 	1 	// Especifica qual timer o clock do uip vai usar
									// 	0 se usar o timer0 ou 1 se usar usar o timer1
#define SERVUS_USE_TIMER		2	// Especifica qual timer que o servus.c vai usar
#define US04_USE_TIMER			2	// Especifica qual timer que o hc-sr04.c vai usar

// ###################################################################################################################
// TIMER0
// LPC1788 MATCH0 = P3_25 TODO - valores temporários
#define MATCH0_ConfigPort0()		{ IOCON_P3_25 = 3; }
// LPC1788 MATCH1 = P3_26 TODO - valores temporários
#define MATCH0_ConfigPort1()		{ IOCON_P3_26 = 3; }

// ###################################################################################################################
// TIMER1
// LPC1788 MATCH0 = P3_29 TODO - valores temporários
#define MATCH1_ConfigPort0() 		{ IOCON_P3_29 = 3; }
// LPC1788 MATCH1 = P3_30 TODO - valores temporários
#define MATCH1_ConfigPort1()		{ IOCON_P3_30 = 3; }

// ###################################################################################################################
// USB
#define USB1_PINSEL			PINSEL_P0		// Porta de seleção dos pinos do LPC para USB2
#define USB1_DP_NUMPIN		29				// Número do Pino do D+
#define USB1_DM_NUMPIN		30				// Número do Pino do D-
#define USB1_NUNFUNC 		1				// Número da função dos pinos para USB

#define USB2_PINSEL			PINSEL_P0		// Porta de seleção dos pinos do LPC para USB2
#define USB2_DP_NUMPIN		31				// Número do Pino do D+
#define USB2_NUNFUNC 		1				// Número da função dos pinos para USB

#define USB_PORT_FUNC		3				// USB1 = HOST e USB2 device
#define HcRhPortStatus 	HcRhPortStatus1 // Definindo que será a porta 1 que vamos trabalhar no USBHostLite

