andersonmeurer/relle.pinel-eletrico-cc/srcWorkTemp/rh/firmware/firmware/uc_libc_dev/_arch/arm_lpc/arch_kit_lpc1788_pr111.h
// INTERVALO DO FRAME DE DADOS
#define USB_FI                     0x2EDF           /* 12000 bits per frame (-1)                               */
#define USB_DEFAULT_FMINTERVAL     ((((6 * (USB_FI - 210)) / 7) << 16) | USB_FI)


// ###################################################################################################################
// CONFIGURAÇÕES DOS LEDS

#define LED1_DIR			GPIO4_DIR
#define LED1_OFF			GPIO4_CLR
#define LED1_ON				GPIO4_SET
#define LED1				BIT_30

#define LED2_DIR			GPIO4_DIR
#define LED2_OFF			GPIO4_CLR
#define LED2_ON				GPIO4_SET
#define LED2				BIT_29

#define LED3_DIR			GPIO4_DIR
#define LED3_OFF			GPIO4_CLR
#define LED3_ON				GPIO4_SET
#define LED3				BIT_28

#define led1_Init()			(LED1_DIR |= LED1)
#define led1_On()			(LED1_ON = LED1)
#define led1_Off()			(LED1_OFF = LED1)

#define led2_Init()			(LED2_DIR |= LED2)
#define led2_On()			(LED2_ON = LED2)
#define led2_Off()			(LED2_OFF = LED2)

#define led3_Init()			(LED3_DIR |= LED3)
#define led3_On()			(LED3_ON = LED3)
#define led3_Off()			(LED3_OFF = LED3)

#define MISC_LED_DIR		LED1_DIR
#define MISC_LED_OFF		LED1_CLR
#define MISC_LED_ON			LED1_SET
#define MISC_LED			LED1

#define USB_LED_DEVCNT1_DIR	LED2_DIR
#define USB_LED_DEVCNT1_OFF	LED2_OFF
#define USB_LED_DEVCNT1_ON	LED2_ON
#define USB_LED_DEVCNT1		LED2

#define SYSTIME_LED_DIR		LED3_DIR
#define SYSTIME_LED_OFF		LED3_OFF
#define SYSTIME_LED_ON		LED3_ON
#define SYSTIME_LED			LED3

#define ERROR_LED_DIR		LED1_DIR
#define ERROR_LED_OFF		LED1_OFF
#define ERROR_LED_ON		LED1_ON
#define ERROR_LED			LED1



// ###################################################################################################################
// CONFIGURAÇÕES TFT

#define TFT_R0_PINSEL		PINSEL_P2	// Endereço base da porta de seleção do pino
#define TFT_R0_NUMPIN		12	// p2_12
#define TFT_R0_NUNFUNC		5
#define TFT_R1_PINSEL		PINSEL_P2	// Endereço base da porta de seleção do pino
#define TFT_R1_NUMPIN		6 	// p2_6
#define TFT_R1_NUNFUNC		7
#define TFT_R2_PINSEL		PINSEL_P2	// Endereço base da porta de seleção do pino
#define TFT_R2_NUMPIN		7 	// p2_7
#define TFT_R2_NUNFUNC		7
#define TFT_R3_PINSEL		PINSEL_P2	// Endereço base da porta de seleção do pino
#define TFT_R3_NUMPIN		8 	// p2_8
#define TFT_R3_NUNFUNC		7
#define TFT_R4_PINSEL		PINSEL_P2	// Endereço base da porta de seleção do pino
#define TFT_R4_NUMPIN		9 	// p2_9
#define TFT_R4_NUNFUNC		7

#define TFT_G0_PINSEL		PINSEL_P1	// Endereço base da porta de seleção do pino
#define TFT_G0_NUMPIN		20 	// p1_20
#define TFT_G0_NUNFUNC		7
#define TFT_G1_PINSEL		PINSEL_P1	// Endereço base da porta de seleção do pino
#define TFT_G1_NUMPIN		21 	// p1_21
#define TFT_G1_NUNFUNC		7
#define TFT_G2_PINSEL		PINSEL_P1	// Endereço base da porta de seleção do pino
#define TFT_G2_NUMPIN		22 	// p1_22
#define TFT_G2_NUNFUNC		7
#define TFT_G3_PINSEL		PINSEL_P1	// Endereço base da porta de seleção do pino
#define TFT_G3_NUMPIN		23 	// p1_23
#define TFT_G3_NUNFUNC		7
#define TFT_G4_PINSEL		PINSEL_P1	// Endereço base da porta de seleção do pino
#define TFT_G4_NUMPIN		24 	// p1_24
#define TFT_G4_NUNFUNC		7
#define TFT_G5_PINSEL		PINSEL_P1	// Endereço base da porta de seleção do pino
#define TFT_G5_NUMPIN		25 	// p1_25
#define TFT_G5_NUNFUNC		7

#define TFT_B0_PINSEL		PINSEL_P2	// Endereço base da porta de seleção do pino
#define TFT_B0_NUMPIN		13 	// p2_13
#define TFT_B0_NUNFUNC		7
#define TFT_B1_PINSEL		PINSEL_P1	// Endereço base da porta de seleção do pino
#define TFT_B1_NUMPIN		26	// p1_26
#define TFT_B1_NUNFUNC		7
#define TFT_B2_PINSEL		PINSEL_P1	// Endereço base da porta de seleção do pino
#define TFT_B2_NUMPIN		27	// p1_27
#define TFT_B2_NUNFUNC		7
#define TFT_B3_PINSEL		PINSEL_P1	// Endereço base da porta de seleção do pino
#define TFT_B3_NUMPIN		28	// p1_28
#define TFT_B3_NUNFUNC		7
#define TFT_B4_PINSEL		PINSEL_P1	// Endereço base da porta de seleção do pino
#define TFT_B4_NUMPIN		29	// p1_29
#define TFT_B4_NUNFUNC		7

#define TFT_DCLK_PINSEL		PINSEL_P2	// Endereço base da porta de seleção do pino
#define TFT_DCLK_NUMPIN		2	// p2_2
#define TFT_DCLK_NUNFUNC	7
#define TFT_ENAB_PINSEL		PINSEL_P2	// Endereço base da porta de seleção do pino
#define TFT_ENAB_NUMPIN		4	// p2_29
#define TFT_ENAB_NUNFUNC	7

#define TFT_CONFIG 			0x2c
	// LcdEn = 0: Disable LCD controller
	// lcdbpp = 6: 16 bpp, 5:6:5 mode.
	// LcdTFT = 1: TFT panel
	// LcdDual = 0: single panel
	// BGR = 0: normal output
	// BEBO = 0: little endian byte order
	// BEPO = 0: little endian pix order
	// LcdPwr = 0: disable power

#define TFT_CLKDIV 7 // 1:8, CPU=120M
	// div7 para 120MHz


// MEMÓRIAS DE VIDEO
#define VRAM_ADDR				SDRAM_BANK0_BASE_ADDR	// 1MB de video para cada pagina
#define VRAM_SIZE 				0x100000 // Tamnaho suficiente para display de 800x600 com 2 bytes por pixel
#define EMWIN_ADDR				SDRAM_BANK0_BASE_ADDR + VRAM_SIZE
#define EMWIN_SIZE				VRAM_SIZE

// TFT
#define TFT_BACKLIGHT_DIR		GPIO2_DIR
#define TFT_BACKLIGHT_CLR		GPIO2_CLR
#define TFT_BACKLIGHT_SET		GPIO2_SET
#define TFT_BACKLIGHT_NUMPIN	(1<<0)

#define TOUCH_X0_DIR			GPIO0_DIR
#define TOUCH_X0_CLR			GPIO0_CLR
#define TOUCH_X0_SET			GPIO0_SET
#define TOUCH_X0_NUMPIN			BIT_25
#define TOUCH_Y0_DIR			GPIO0_DIR
#define TOUCH_Y0_CLR			GPIO0_CLR
#define TOUCH_Y0_SET			GPIO0_SET
#define TOUCH_Y0_NUMPIN			BIT_26
#define TOUCH_X1_DIR			GPIO0_DIR
#define TOUCH_X1_CLR			GPIO0_CLR
#define TOUCH_X1_SET			GPIO0_SET
#define TOUCH_X1_NUMPIN			BIT_27
#define TOUCH_Y1_DIR			GPIO0_DIR
#define TOUCH_Y1_CLR			GPIO0_CLR
#define TOUCH_Y1_SET			GPIO0_SET
#define TOUCH_Y1_NUMPIN			BIT_28

#define TOUCH_SAMPLES 			4 // define a quatidade de amostras por canal para validar uma leitura
#define TOUCH_USE_READ			TOUCH_USE_AD
	#define TOUCH_ADC_CLK		10000000 		// Velocidade de 10MHz para o clock do AD para leitura do touch
	#define TOUCH_X0_AD0		AD0_CHANNEL2	// Canal AD2 para o X0
	#define TOUCH_Y0_AD1		AD0_CHANNEL3	// Canal AD2 para o Y0

	#define TOUCH_X0_IOCON		IOCON_P0_25
	#define TOUCH_Y0_IOCON		IOCON_P0_26
	#define TOUCH_X1_IOCON		IOCON_P0_27
	#define TOUCH_Y1_IOCON		IOCON_P0_28
		#define TOUCH_PIN_MODEAD		9 		// pino para adc modo analógico com resistor pulldown
		#define TOUCH_PIN_MODEIO		0x80	// pino para gpio modo digital sem resistor pull



// ###################################################################################################################
// PWM 0
#define pwm0_ConfigPort() 		{ IOCON_P3_21 = 2; } // pino para PWM0[6] p3_21


// ###################################################################################################################
// ADC e DAC (TOUCH)
#define ADC0_ConfigPort()		{ IOCON_P0_24 = 1; } 	// pino P0_24 como ADC[1], sem resistores de PULL, entrada analógica filtrada
														// os demais AD deixar em cargo do controlador do touchscreen

// ###################################################################################################################
// DAC

// DACOUT = P0_26
#define DAC_ConfigPort()		{ IOCON_P0_26 = 0x10002; } 	// pino P0_26 como DAC_OUT, sem resistores de PULL, saida analógica filtrada

// ###########################################################################################################################################
// ########### CONFIGURAÇÕES DO BEEP
#define BEEP_DIR				GPIO0_DIR
#define BEEP_CLR				GPIO0_CLR
#define BEEP_SET				GPIO0_SET
#define BEEP_NUMPIN				(1<<5)

// ###########################################################################################################################################
// ########### CONFIGURAÇÕES DO BARRAMENTO EXTERNO
// TODO ainda não testado este modelo de configuração de memórias
//#### CONFIG  MEMÓRIAS STÁTICAS OU DISPOSITIVOS MAPEANDOS POR RAM
#define SRAM_MEMORY_EXTENDED_WAIT 0								// Valor de 0 a x3ff. Para dispositivo lentos que usam Tempo de espera extra nos acessos ao barramento
#define SRAM_BANK0_USE SRAM_BANK_USE_NONE						//
#define SRAM_BANK1_USE SRAM_BANK_USE_NONE						//
#define SRAM_BANK2_USE SRAM_BANK_USE_DISPO_GENERIC_8BITS		// Banco selecionado pelo #CS2 entre os endereços 0x98000000 - 0x9bffffff
#define SRAM_BANK3_USE SRAM_BANK_USE_DISPO_GENERIC_16BITS		// Banco selecionado pelo #CS3 entre os endereços 0x9c000000 - 0x9fffffff

//	#### CONFIG MEMÓRIAS SDRAMS. SOMENTE ESTAMOS TRABALHANDO COM O BANCO 0,
//		PORÉM SE FAZER PARA OUTROS BANCOS VAMOS USAR O MESMO VALOR PARA TODOS
// 	os tipos estão em arch.h
#define	SDRAM_BANK0_USE MT48LC16M162P_7E_PC133					// Banco selecionado pelo #DYCS0 entre os endereços 0xA000 0000 a 0xAFFF FFFF

// Ajuste fino no atraso do clock do EMC a SDRAM.
// pagina 185 datasheet
//	O ajuste do atraso pode ser feito  entre 250ps a 7.75nS.
// Neste hardare estamos usando somente a SDRAM no CLK0, por isso vamos ajustar somemte CMDDLY, FBCLKDLY, CLKOUT0DLY
//   CLK --> CMDDLY[4:0]  --> EMC --> CLKOUT0DLY[20:16] --> SDRAM
//								  <-- FBCLKDLY[12:8]
// Fórmula REG+1 * 250ps

