andersonmeurer/relle.pinel-eletrico-cc/srcWorkTemp/rh/firmware/firmware/uc_libc_dev/_arch/arm_lpc/arch_kit_lpc1788_pr111.h
// OBS: Geralmente ajustamos FBCLKDLY
#if defined (KIT_LPC1788_PR111)
// Nesta SDRAM vamos adotar atrasos de 5nS
#define SDRAM_CLK_DELAY		0x141414
#else
// Nesta SDRAM vamos adotar atrasos de 4ns
#define SDRAM_CLK_DELAY		0x101010
// #define SDRAM_CLK_DELAY		0x101410
// #define SDRAM_CLK_DELAY		0x081414
#endif

// ###########################################################################################################################################
// ########### NAND FLASH
#define NAND_CONNECTION	NAND_CONNECTION_PIO		// Tipo de conexão que esse hardware tem com a memória NAND FLASH
#define nand_Delay()	{ nop(); nop(); nop(); nop(); nop(); nop(); } //6 nop * 120MHz = 50ns

#define NAND_BUS_DIR			GPIO1_DIR
#define NAND_BUS_SET			GPIO1_SET
#define NAND_BUS_CLR			GPIO1_CLR
#define NAND_BUS_PIN			GPIO1_PIN
#define NAND_BUSDATA_PIN		GPIO1_PIN0 // somente acessa GPIO[7:0]
#define NAND_CE					BIT_8
#define NAND_RE					BIT_9
#define NAND_CLE				BIT_10
#define NAND_ALE				BIT_13
#define NAND_WE					BIT_14
#define NAND_WP					BIT_15
#define NAND_RB					BIT_16

// ###########################################################################################################################################
// ########### DEVIO
#define DEVIO_QTD_DEVICES 10

// ########### BUZZER
#define BUZZER_DIR			GPIO0_DIR
#define BUZZER_OFF			GPIO0_CLR
#define BUZZER_ON			GPIO0_SET
#define BUZZER				BIT_5


// ###################################################################################################################
// INTERRUPÇÕES EXTERNAS (valores temporários)

#define ENTI0_ConfigPort()		{ IOCON_P0_29 = 2; } 	// pino P0_29 como EINT0
#define ENTI1_ConfigPort()		{ IOCON_P0_30 = 2; } 	// pino P0_30 como EINT1


#endif
